---
type: ExportPatternInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportPatternInfo

`Autodesk.Revit.DB.ExportPatternInfo` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportPatternInfo | — | `` |
| Constructor | ExportPatternInfo | 2014 | `public ExportPatternInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DestinationPatternName | 2014 | `public string DestinationPatternName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |